salara1960/stm32f411/Src/main.c
	HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	return (sprintf(st, "%02u.%02u %02u:%02u:%02u",
						sDate.Date, sDate.Month,
						sTime.Hours, sTime.Minutes, sTime.Seconds));
}
//-------------------------------------------------------------------------------------------
void Report(const char *tag, unsigned char addTime, const char *fmt, ...)
{
va_list args;
size_t len = MAX_UART_BUF;
int dl = 0;
//char *buff = &txData[0];

	if (!txDoneFlag) return;

	char *buff = (char *)calloc(1, len);//pvPortMalloc(len);//vPortFree(buff);
	if (buff) {
		txDoneFlag = 0;

		if (addTime) dl = sec_to_str_time(buff);
		if (tag) dl += sprintf(buff+strlen(buff), "[%s] ", tag);

		va_start(args, fmt);
		vsnprintf(buff + dl, len - dl, fmt, args);
		va_end(args);

		HAL_UART_Transmit_DMA(&huart1, (uint8_t *)buff, strlen(buff));

		/*while (HAL_UART_GetState(&huart1) != HAL_UART_STATE_READY) {
				if (HAL_UART_GetState(&huart1) == HAL_UART_STATE_BUSY_RX) break;
				//HAL_Delay(1);
		}*/

		free(buff);//vPortFree(buff);
	}
}
//------------------------------------------------------------------------------------------
void set_Date(time_t ep)
{
struct tm ts;

	//setSec((uint32_t)ep);

	if (!localtime_r(&ep, &ts)) return;

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;
	sDate.WeekDay = ts.tm_wday;
	sDate.Month   = ts.tm_mon + 1;
	sDate.Date    = ts.tm_mday;
	sDate.Year    = ts.tm_year;
	sTime.Hours   = ts.tm_hour + tZone;
	sTime.Minutes = ts.tm_min;
	sTime.Seconds = ts.tm_sec;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) == HAL_OK) {
		if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) == HAL_OK) setDate = 1;
	}

}
//
//------------------------------------------------------------------------------------------
uint32_t get_DateTime()
{
struct tm ts;
RTC_TimeTypeDef sTime;
RTC_DateTypeDef sDate;

	if (HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) return 0;
	if (HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) return 0;

	ts.tm_hour = sTime.Hours;
	ts.tm_min  = sTime.Minutes;
	ts.tm_sec  = sTime.Seconds;

	ts.tm_wday = sDate.WeekDay;
	ts.tm_mon  = sDate.Month - 1;
	ts.tm_mday = sDate.Date;
	ts.tm_year = sDate.Year;

	return ((uint32_t)mktime(&ts));
}
//-------------------------------------------------------------------------------------------
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if (hadc->Instance == ADC1) {
		iadc_cnt++;
		startADC = 0;
		putMsg(msg_adcReady);
	}
}
//-------------------------------------------------------------------------------------------
void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{
	if (hadc->Instance == ADC1) devError |= devADC;
}
//-------------------------------------------------------------------------------------------
uint8_t VccAddVal(uint16_t value)
{
int8_t i;

	if (!VccValCounter) {
		for (i = 0; i < MAX_VCC_BUF; i++) VccBuf[i] = value;
		VccValCounter = MAX_VCC_BUF;
	} else {
		for (i = MAX_VCC_BUF - 2; i >= 0; i--) VccBuf[i + 1] = VccBuf[i];
		VccBuf[0] = value;
		if (VccValCounter < MAX_VCC_BUF) VccValCounter++;
	}
    return VccValCounter;
}
//-------------------------------------------------------------------------------------------
uint8_t CompAddVal(float value)
{
int8_t i;

	if (!CompValCounter) {
		for (i = 0; i < MAX_COMP_BUF; i++) CompBuf[i] = value;
		CompValCounter = MAX_COMP_BUF;
	} else {
		for (i = MAX_COMP_BUF - 2; i >= 0; i--) CompBuf[i + 1] = CompBuf[i];
		CompBuf[0] = value;
		if (CompValCounter < MAX_COMP_BUF) CompValCounter++;
	}
    return CompValCounter;
}
//-------------------------------------------------------------------------------------------
void procCompas()
{
	cStat = COPMAS_ReadStat() & 1;
	if (cStat) {
		if (COPMAS_GetAngle() != HAL_OK) devError |= devI2C1;
	}
}
//------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------
char *printOut(char *tmp)
{

switch (outMode) {

#ifdef SET_cJSON
	case cjsonMode:
	{
		cJSON *obj = cJSON_CreateObject();
		if (obj) {
			char dt[32] = {0};
			sec_to_str_time(dt);
			cJSON_AddItemToObject(obj, "time", cJSON_CreateString(dt));
			cJSON_AddItemToObject(obj, "ms", cJSON_CreateNumber(tik));
			cJSON *arr1 = cJSON_CreateArray();
			if (arr1) {
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)cnt_evt));
				cJSON_AddItemToArray(arr1, cJSON_CreateNumber((int)max_evt));
				cJSON_AddItemToObject(obj, "fifo", arr1);
			} else devError |= devMem;
			cJSON_AddItemToObject(obj, "devError", cJSON_CreateNumber(devError));
			cJSON_AddItemToObject(obj, "volt", cJSON_CreateNumber(VccF));
			//
#ifdef SET_BMx280
			cJSON *sens1 = cJSON_CreateObject();
			if (sens1) {
				cJSON_AddItemToObject(sens1, "pres", cJSON_CreateNumber(sensors.bmx_pres));
				cJSON_AddItemToObject(sens1, "temp", cJSON_CreateNumber(sensors.bmx_temp));
				if (reg_id == BME280_SENSOR) cJSON_AddItemToObject(sens1, "humi", cJSON_CreateNumber(sensors.bmx_humi));
				cJSON_AddItemToObject(obj, bmxName, sens1);
			} else devError |= devMem;
#endif
			//
			cJSON *sens2 = cJSON_CreateObject();
			if (sens2) {
				cJSON_AddItemToObject(sens2, "azimut", cJSON_CreateNumber(compData.angleHMC));
				cJSON_AddItemToObject(sens2, "temp2", cJSON_CreateNumber(compData.tempHMC));
				cJSON_AddItemToObject(obj, "QMC5883L", sens2);
			} else devError |= devMem;
			//
			cJSON *sens3 = cJSON_CreateObject();
			if (sens3) {
				cJSON_AddItemToObject(sens3, "stat", cJSON_CreateNumber(mpuStatus));
				cJSON_AddItemToObject(sens3, "temp3", cJSON_CreateNumber(mpu_data.TEMP));
				cJSON *arr2 = cJSON_CreateArray();
				if (arr2) {
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.xACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.yACCEL));
					cJSON_AddItemToArray(arr2, cJSON_CreateNumber(mpu_data.zACCEL));
					cJSON_AddItemToObject(sens3, "accel", arr2);
				} else devError |= devMem;
				cJSON *arr3 = cJSON_CreateArray();
				if (arr3) {
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.xGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.yGYRO));
					cJSON_AddItemToArray(arr3, cJSON_CreateNumber(mpu_data.zGYRO));
					cJSON_AddItemToObject(sens3, "gyro", arr3);
				} else devError |= devMem;
				cJSON_AddItemToObject(obj, "MPU6050", sens3);
			} else devError |= devMem;
			//
			char *st = cJSON_PrintBuffered(obj, sizeof(tmp) - 1, jtune);
			if (st) {
				strcpy(tmp, st);
				strcat(tmp, ">");
				free(st);
			}

			cJSON_Delete(obj);

		} else devError |= devMem;
	}
	break;
#endif

	case jsonMode:
	{
		char dt[32] = {0};
		sec_to_str_time(dt);
		if (jtune) {
			sprintf(tmp, "{%s  \"time\": \"%s\",%s  \"ms\": %lu,%s  \"fifo\": [%u,%u]",
					cr_lf, dt, cr_lf, tik, cr_lf, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",%s  \"devError\": %X", cr_lf, devError);
			sprintf(tmp+strlen(tmp), ",%s  \"volt\": %.3f", cr_lf, VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",%s  \"%s\": {%s    \"pres\": %.2f,%s    \"temp\": %.2f",
					cr_lf, bmxName, cr_lf, sensors.bmx_pres, cr_lf, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",%s    \"humi\": %.2f", cr_lf, sensors.bmx_humi);
			sprintf(tmp+strlen(tmp), "%s  }", cr_lf);
#endif
			sprintf(tmp+strlen(tmp), ",%s  \"QMC5883L\": {%s    \"azimut\": %.2f,%s    \"temp2\": %.2f%s  }" ,
					cr_lf, cr_lf, compData.angleHMC, cr_lf, compData.tempHMC, cr_lf);
#ifdef SET_MPU
			sprintf(tmp+strlen(tmp), ",%s  \"MPU6050\": {%s    \"stat\": %X,%s    \"temp3\": %.2f,%s    \"accel\": [%d,%d,%d],%s    \"gyro\": [%d,%d,%d]%s  }%s",
							cr_lf, cr_lf,
							mpuStatus, cr_lf,
							mpu_data.TEMP, cr_lf,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL, cr_lf,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO, cr_lf, cr_lf);
#endif
		} else {
			sprintf(tmp, "{\"time\": \"%s\",\"ms\": %lu,\"fifo\": [%u,%u]", dt, tik, cnt_evt, max_evt);
			sprintf(tmp+strlen(tmp), ",\"devError\": %X", devError);
			sprintf(tmp+strlen(tmp), ",\"volt\": %.3f", VccF);
#ifdef SET_BMx280
			sprintf(tmp+strlen(tmp), ",\"%s\": {\"press\": %.2f,\"temp\": %.2f",
					bmxName, sensors.bmx_pres, sensors.bmx_temp);
			if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",\"humi\": %.2f", sensors.bmx_humi);
			strcat(tmp, "}");
#endif
			sprintf(tmp+strlen(tmp), ",\"QMC5883L\": {\"azimut\": %.2f,\"temp2\": %.2f}", compData.angleHMC, compData.tempHMC);
#ifdef SET_MPU
			sprintf(tmp+strlen(tmp), ",\"MPU6050\": {\"stat\": %X,\"temp3\": %.2f,\"accel\": [%d,%d,%d],\"gyro\": [%d,%d,%d]}",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

